---
kind: other
id: Methods.T:Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel
source: html/3ffc81d1-c757-1475-76f7-91a02eb76433.htm
---
# EnergyAnalysisDetailModel Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.